{
    "Projects": [
        {
            "Title": "Traumatic Toybox",
            "Date": "January 2024 - May 2024",
            "Tools": ["C#", "Unity", "Visual Studio"],
            "Description": "Traumatic Toybox started initially as a project for class that focused on the production of game development. It is a first person stealth game where the protagonist is a toy that must escape a toybox full of murderous teddy bears who are out for blood (stuffing). I took the role of the Lead Programmer in which I was in charge of developing the basic movement including sprinting, crouching, and the stamina meter. I was also responsible for the enemy detection icons that appear differently if the enemy is on or off the screen.",
            "Links": [
                {
                    "Name": "itch.io Page",
                    "Link": "https://avb999.itch.io/traumatic-toybox"
                },
                {
                    "Name": "Demo",
                    "Link": "https://www.youtube.com/watch?v=yw9JfkdARDk"
                }
            ],
            "Image": 
            {
                "src": "img/traumatic.gif",
                "alt": "gif of protagonist trying to run away from the enemies and failing"
            }

        },
        {
            "Title": "Foundation of Game Graphics Programming",
            "Date": "August 2023 - December 2023",
            "Tools": ["C++", "HLSL", "Direct X 11", "Visual Studio"],
            "Description": "During my time at RIT, I enrolled in a class that delved deep into the world of game graphics programming. Beginning with a thorough exploration of meshes as the fundamental building blocks for 3D object rendering, the course progressed to the development of camera systems, translating world space events into the player's perspective. The focal point was the utilization of shaders and HLSL code to govern on-screen processing, enabling the rendering of shadows, imparting depth and shine to objects, facilitating the incorporation of post-processing effects like blurring, and much more. This class not only served as a robust introduction to game graphics but also refined crucial programming skills, emphasizing algorithm navigation and the implementation of intricate systems.",
            "Links": [
                {
                    "Name": "Repository",
                    "Link": "https://github.com/BlckHawker/IGME-540"
                }
            ],
            "Image": {
                "src": "img/IGME 540.gif",
                "alt": "Post Processing Demonstration"
            }
        },
        {
            "Title": "Casper's Cat Cafe",
            "Date": "January 2023 - April 2023",
            "Tools": [
                "C#",
                "Visual Studio",
                "Unity"
            ],
            "Description": "This is an academic group project where we were tasked to make a casual game. My group decided to make an app that could be played on desktop or a mobile device where the player was in charge of a cat cafe. They would play mini games in order to earn a currency called treats. When they have enough treats, they can spend them at the adoption center that will give them a random cat to roam around the floor. One of my contributions was to create a saving system that would save the players' amount of treats and track which cats have been collected. My other main task was the creation of two of our mini games.\nThe first mini game that I created has the player working as a barista. They will be bombarded with coffee orders that they need to prepare in a short amount of time. The game rewards players with fast reflexes by giving more points the faster they complete the order. I also implemented a tutorial system that uses pictures from the minigame in order to familiarize the user with the layout. In addition, I developed a high score system that has increased the amount of competitiveness and replayability in our playtests.\nThe other minigame I created was a fishing simulator. The player would have to wait until a fish bites on their line, and reel the fish in by spamming the “pull” button. The amount of clicks it took for a fish to get caught would depend on their size: small, medium, or large. The larger the fish, the bigger the reward would be. If the player did not spam enough, the fish would break free and the player would have to wait for another fish. Due to time constraints, the minigame was not finalized and did not make it into our final build of the game.\nI also helped with the adoption system. When you adopt a cat that is a duplicate of one you have already obtained, the game will give the user a 50% refund.",
            "Links": [
                {
                    "Name": "Latest Build",
                    "Link": "https://github.com/andrewrama/IGME450/releases/tag/2-10-23"
                },
                {
                    "Name": "Demo",
                    "Link": "https://youtu.be/Vu_ZcVhQJqA"
                }
            ],
            "Image": {
                "src": "img/casper.gif",
                "alt": "Barista Game Demonstration"
            }
        },
        {
            "Title": "Ultimate Tic Tac Toe",
            "Date": "December 2022",
            "Tools": [
                "Javascript",
                "PixiJS","Visual Studio Code"
            ],
            "Description": "This project is a twist of the game Tic Tac Toe where the entire game is made up of 9 smaller tic tac toe boards. When someone wins a smaller board, the player’s symbol gets displayed over the small board. When a player wins enough boards to make a tic tac toe, they win the game.",
            "Links": [
                {
                    "Name": "Play Here",
                    "Link": "https://blckhawker.github.io/Ultimate-Tic-Tac-Toe/"
                }
            ],
            "Image": {
                "src": "img/ultimate-tic-tac-toe.gif",
                "alt": "Ultimate Tic Tac Toe Gameplay"
            }
        },
        {
            "Title": "Pokemon Finder",
            "Date": "November 2022",
            "Tools": [
                "Javascript",
                "HTML",
                "CSS",
                "PixiJS", "Visual Studio Code"
            ],
            "Description": "This website allows users to look up Pokemon based on type, either the exact type or types that are weak or strong against a specific type. This site was made to learn how to use APIs along with extracting information from a JSON file. I also learned a little about dynamic displays since I was unaware about how much data would be extracted every time.",
            "Links": [
                {
                    "Name": "Website",
                    "Link": "https://people.rit.edu/nab6476/235/project2/"
                }
            ],
            "Image": {
                "src": "img/pokemon.gif",
                "alt": "Pokemon Finder Demonstration"
            }
        },
        {
            "Title": "Conway’s Game of Life",
            "Date": "October 2022",
            "Tools": [
                "Javascript",
                "HTML",
                "CSS","Visual Studio Code"
            ],
            "Description": "Conway’s game is a zero player game that simulates how population grows/shrinks depending on adjacent neighbors. This was one of my first projects using loops in javascript to create a game-like function.",
            "Links": [
                {
                    "Name": "Website",
                    "Link": "https://blckhawker.github.io/Conways-Game-of-Life/"
                },
                {
                    "Name": "Repository",
                    "Link": "https://github.com/BlckHawker/Conways-Game-of-Life"
                }
            ],
            "Image": {
                "src": "img/conway.gif",
                "alt": "Conway’s Game of Life Demonstration"
            }
        },
        {
            "Title": "Volatile Vermin",
            "Date": "January 2021 - May 2021",
            "Tools": [
                "C#",
                "MonoGame","Visual Studio"
            ],
            "Description": "This was a group project for one of my classes; it's also the first game I created. The game is a top down shooter where the player has to kill all enemies in the level in order to progress to the next one. The game is won when the player passes all the levels. My task was to create a level editor in order to have other members of my group easily create levels. I also implemented a high score system where players who get a top 5 score can put their initials in and is displayed on other playthroughs.",
            "Links": [
                {
                    "Name": "Demo",
                    "Link": "https://youtu.be/v1BvdzU7wZQ"
                }
            ],
            "Image": {
                "src": "img/vermin.png",
                "alt": "Volatile Vermin"
            }
        }
    ]
}