{
    "ProjectIdeas": [
        {
            "Title": "Mentor Schedule Maker",
            "Description": "At my time at RIT, I joined the <a href=\"https://sse.rit.edu\" target=\"_blank\">Society of Software Engineers</a>. It's an academic organization that mainly focused on mentoring (tutoring) students who are majoring in Software Engineering related field. The \"Mentor Head\" would be responsible for making the schedule of which mentor(s) would be assigned each shift based on their availability. Since the Mentor Head has many other responsibilities, I thought it would be a good idea to alleviate one of those problems with a schedule generator. Given the name and availability of each mentor, the software would generate all possible schedules, verifying that nobody is overworked."
        },
        {
            "Title": "KTANE FAQ Bot",
            "Description": "As someone who spends a lot of time in the <a href=\"https://discord.gg/ktane-160061833166716928\" target=\"_blank\">Keep Talking and Nobody Explodes (KTANE)</a> server, I tend to answer the same questions multiple time as new people decide to mod the game. Although I am happy to answer their question, it can be repetitive and time consuming, especially if the person does not have a lot of programming/Unity knowledge.\nThe server does have a channel that resembles a FAQ forum, though it can be difficult to navigate through when you're looking for a specific question. I plan for this bot to be an improvement of the FAQ channel by having questions to be grouped by their similarity. For example, one section could be about mod making in unity while another one can be about manual making with HTML. The collections of questions can be navigated through reactions. Since the bot will be in the official discord server, it should have a better chance of being used as opposed to various tutorials that are scattered on YouTube."
        },
        {
            "Title": "Q Learning Rubik's Cube",
            "Description": "I was always mesmerized with Rubik's Cubes. When I finally learned an algorithm that guarantees the cube would be solved, I felt a great wave of pride. Although I never had the time to get into the hobby myself, I enjoy watching competitive cubing. I find the idea of memorizing patterns in order to optimize the solving process fascinating. A few years later, I took a class that focused on the use AI in games. We learned about neural networking and Q learning (a machine learning algorithm where the machine iteratively learns how to solve something and improves over time). I figured a rubik's cube would be a great puzzle to understand the algorithm more."
        },
        {
            "Title": "Rock Paper Scissors Boids",
            "Description": "At RIT, I took a class that taught me how to use Unity, mainly scripting. One of the projects I was assigned was to create a project use boids (artificial intelligence to simulate free will of objects, mainly through movement). The theme of my project, at the time, was Human vs Zombies (a large game of tag where the zombies are it). The humans' only job was to run away, while the zombies' job was to chase the humans. There was nothing for the \"player\" to do besides watch the simulation run.\nI have the idea of changing the theme to Rock Paper Scissors where each boids would run away and chase each target. When a collision happens, a boid will change to another team. For example, rocks colliding to paper will turn into paper. I am planning to add sliders that will change the stats of each boids including but not limited to: movement speed, the radius of their vision, how much they prefer chasing something rather than running away, etc. The player will also have the option to place obstacles anywhere on the map that all boids will need to avoid in order to not get deleted."
        },
        {
            "Title": "Dynamic Binary Puzzle Solver",
            "Description": "I created a <a href=\"https://www.puzzle-binairo.com\" target=\"_blank\">Binary Puzzle (also known as Binario)</a> solver during my <a href=\"{root}/projects/ktane.html#Solver\" target=\"_blank\">KTANE solver saga</a>. The KTANE version always generated a 6x6 puzzle, but I have recently started solving some with a larger size. I want to challenge myself by making a solver where the dimensions are not constant. This will force me to think about what rules work for one size and not for others and apply them in the appropriate context."
        },
        {
            "Title": "Budget Tracker",
            "Description": "I like my life to be organized, and technology has made that job easier. This applies to budgeting apps including a wishlist function. However, a big task like this can be done in several ways, and I never found an app that exactly fits my preferences; not to mention one that is free without some form of restriction.\nI want to be able to have items sectioned into categories (Needs, Wants, Savings, etc). These categories can then either have items or more subcategories, making a tree structure with a limited depth. The user will have the option of depositing or withdrawing money to/from a certain item/category along with notes. I'm planning on having depositing be customizable where the user has the option of automatically giving a certain category a percentage of the deposit. Or have a priority system where all the money goes into a certain category until the \"goal amount\" is reached. Then all deposited money will go into the next category. I also want each category to have its own stats section where users can see what they're spending most of their money on."
        },
        {
            "Title": "Sudoku Solver",
            "Description": "I have learned to do Sudoku puzzles at a very young age. However, I never found myself finishing most of them. I found myself being very slow at deducing what the number of each cell was as I needed to slowly look at the respective row, column, and block. I always wondered if there were more sophisticated deductions, and I think making a solver will aid me in answering that question."
        },
        {
            "Title": "1 Player Ultimate Tic Tac Toe",
            "Description": "In 2022, I made <a href=\"{root}/projects/index.html#Ultimate-Tic-Tac-Toe\" target=\"_blank\">Ultimate Tic Tac Toe</a> where one cell of the game is its own version of tic tac toe. I made it two players as it was a school project and I was pressed for time. I always wanted to make it a single-player game to challenge my skills of creating AI that replicates playing against a real person.\nI have thought of using different algorithms to achieve this goal and have different levels of difficulty. I thinking of having \"Easy\" perform random moves and harder difficulties using mini-maxing with different parameters."
        },
        {
            "Title":"Tiny Tower Full Stack Project",
            "Description": "<a href=\"https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwjVwMSyhYCJAxXIEmIAHdKYEm0QFnoECEwQAQ&url=https%3A%2F%2Fplay.google.com%2Fstore%2Fapps%2Fdetails%3Fid%3Dcom.nimblebit.tinytower%26hl%3Den_US&usg=AOvVaw35Dk94k17LXpVm4iseGFsP&opi=89978449\" target=\"_blank\">Tiny Tower</a> is an idle mobile game where the user is a manager of a multi-purpose tower. Each floor of the tower either sells products, or are resident floors for employees of the product floors. Each employee has stats that affect how well they do their job on certain floors. I've been playing this game on and off for over a decade. Throughout that time, I have thought of creating a \"solver\" that would tell the user the best optimization of floors to buy and where to hire people. Although I still like this idea and plan to implement it, it's too opened minded as there are a lot of factors in play. It would be better to create a simulation of the game where the user can easily put their data in first, and then start working on an optimization.\nI could make the simulation a Windows Form GUI the same way I did for my <a href=\"{root}/projects/ktane.html#Solver\" target=\"_blank\">KTANE Solver</a> project, but that seems too easy (and not that pretty). I want this project to challenge my front-end UI/UX skills in order to get the desired information from the user. I would also like to create a backend using a database like Postgres in order to hold said information."
        },
        {
            "Title": "Papyrus Tiles: Yellow Tiles + Breadth First Search Path Finder",
            "Description": "\"Papyrus Tiles\" is one of my <a href=\"{root}/projects/index.html\" target=\"_blank\">KTANE mods</a> that resembles the tile puzzle from <a href=\"https://undertale.com\" target=\"_blank\">Undertale</a>. Each tile affects the player in a neutral or negative way, with the latter causing a stirke. The goal is to reach the other side of the grid without getting a strike. I implemented all of the tile colors with the exception of the yellow one where the user will be zapped and forced to move back on the last tile they stepped on causing a strike. It was not initially implemented due to time constraints, but it's definitely something not difficult with my current set of skills.\nAnother feature I've been wanting to improve on is the pathfinder for verifying a puzzle is solvable. The current version of the mod uses recursion to find a path, but it's not reliable as it doesn't guarantee the shortest path. I also noticed it can get stuck in infinite loops at times. Breadth first search is definitely a better algorithm to use in this context."
        },
        {
            "Title": "Stardew Valley 100% Guide Mod",
            "Description": "<a href=\"https://www.stardewvalley.net\" target=\"_blank\">Stardew Valley</a> is farming game that surprisingly has a lot of content besides farming. This makes 100% the game a very long task to complete, especially since there are multiple ways to do something. I have often thought \"I wish there was a mod that told me to hold onto these items so I don't have to grind them later.\" That is one of the things I want the mod to do. I also want to have a \"quest list\" so the player knows what to do in order to progress to 100%."
        },
        {
            "Title": "Path Finder Visualizer",
            "Description": "There are many path finding algorithms with various levels of efficiency. It can be rather difficult to fully understand how slow certain algorithms can be using small mazes. Creating a program that allows users who use a dynamic size for mazes and allows them to place their own walls (or by randomly assign them) can show how much better it is. I could also add statistics such as how many nodes were visited along with the amount of real time it took. I could also allow mazes and search results to be saved and loaded, and have a comparer. This would be a stretch goal, but this project would also work for a \"Papyrus Tiles\" maze."
        },
        {
            "Title": "Hashi Puzzle Solver",
            "Description": "Hashi (also known as bridges) is a puzzle where the player must connect nodes together with single or double edges that can come out of each node orthogonally. Each node has a number on it represent the required amount of edges that needs to come out of that node. The goal is to connect the nodes in such as way that each node has the right amount of edges and all the nodes connect in a way such that there is only one map. I find myself doing this puzzle a lot and would like to see if there is a way to program a solver. The only initial roadblock I see is figuring out when making an edge between nodes will cause an intersection, but I think that one be a problem once I think about it more."
        },
        {
            "Title": "Workout Tracker",
            "Description": "I have been physically active ever since I was a child by doing various sports. It was difficult to keep active while I was in college. I downloaded the app \"<a href=\"https://www.stardewvalley.net\" target=\"_blank\">Strong</a>\" which has very useful features such as creating workout templates, easily adding/removing a set to a workout, and cooldown timer between sets. Unfortunately, there are several features that are locked behind a paywall, including seeing your progress by doing a specific workout. I understand the \"freemium\" models of applications, but it's not for me. Creating a mobile application of my own will allow me to implement features that work for me specifically without any financial costs." 
        },
        {
            "Title": "Towers Puzzle Solver",
            "Description": "<a href=\"https://www.puzzle-skyscrapers.com\" target=\"_blank\">Towers (also known as skyscrapers)</a> is another puzzle of a 4x4 grid in which each row/column has a number on each side. This number represents the towers that can be seen by that perspective. Towers have a height of 1-4 inclusively, and can be placed on any of the cells. The goal is to fullfil the row/column numbers while only being able to place one tower of each height per row/column.\nThis was one of my first puzzles that allowed me to see what other kinds of puzzle there are. I was first introduced to it in my junior year of highschool when I took AP CSA. This wasn't something that we were allowed to use computers for, and was forced to solve it with pen and paper. Unfortunately, I was not able to get it done and it has been bothering me since. I could definitely make a solver simply with some recursion, though I would like to figure out what are some deduction I can make to easily solve the puzzle." 
        },
        {
            "Title": "Password Generator",
            "Description": "Passwords are very important security measures that can sometimes being the only thing locking people out of your personal information. This risk can be reduced by having extra security measures such as 2 factor authentication, but many people fail to do this. Regardless of if extra security measures a present or not, it's important to have a good password. There are several password generators that gives passwords that look like they gave a 3 year old the keyboard. This is because the password is so random that it's difficult for hackers to guess. However, it can also be difficult for the user the remember. This is what password managers such as the ones that are native to many web browsers are for. They hold onto the passwords so you don't have to remember them, and you need to remember just one password. Though, this means that all of your information are in a vault in which a hacker needs guess one password in order to get all of them.\nThe \"<a href=\"https://www.youtube.com/watch?v=3NjQ9b3pgIg\" target=\"_blank\">Computerphile</a>\" suggests creating a password that is a string of 3-5 random words with some of the letters being replaced with special characters. And not special characters where you replace a 'e' with a '3' as that's too predictable. A better example would be changing a random consonant to a '#'; this decreases the chances of hacker taking your information. I use one of these password managers, and though they are very useful for holding passwords, it's rather difficult to quickly get a password for a new account Although there are some applications that generate passwords, they only generate the ones thats should be used as the \"non-main\" password. Having an option of if the generated password should be a \"main\" password can encourage people to be more careful with their information."
        },
        {
            "Title": "DND Dice Roller + Manager",
            "Description":"I got into my first DND campaign in 2023, and I love it. Though the rules can be a bit confusing and since the entire party persists of people who are also new, it can be difficult for my DM to remind people. I have thought of creating a manager system that would keep track of information. I'm planning on making so people can have multiple character sheets for different campaign. There will be a notes section that has a title, date, and session # properties so people can easily find them.\nI also want to add a dice roller section so people can do other things besides doing math the entire session. This includes a button for each type of saving throw, along with each skill check with the option of adding if it's with advantage/disadvantage. I also want to add attack rolls as well. Since the character (and their loot) is already loaded, the bonuses from the skills and modifies should already be in the application's memory. So the player just needs to press the button and get the results. This should significantly decrease the time of other people waiting for someone to adding up 7 numbers."
        },
        {
            "Title": "KTANE Mod Setting Support",
            "Description":"Mod settings support allows certain mods parameters to be easily modified outside of Unity. In most cases, it is used in order to make a mod easier for learning purposes or harder for more of a challenge. I would like to add this support to some of my mods to make them more accessible. I also want to understand it more so I can write documentation on how to implement it for my FAQ KTANE bot."
        },
        {
            "Title": "KTANE Rule Seed Support",
            "Description":"Similar to mod setting support, rule seed support is another set of modification to KTANE mods. These however, change the mod's rules based on a seed number. The seed number can be quite large, so the same mod keeps from becoming stale. This is another feature I wnt to add to my mods in order to properly write documentation for the FAQ Bot."
        },
        {
            "Title": "KTANE Decompilation",
            "Description":"While it's common practice to keep the source code of KTANE mods open-sourced on GitHub, some mods' code have become unavailable for various reasons. This lack of public source code can limit community engagement. If there is a bug and the author is not active, the mod is marked as incompatible since others are unable to fix the issue. Additionally, mods without accessible source code are less likely to gain new features like Twitch Plays, Rule Seed Support, and Mod Settings if they weren't there in the original build.\nDecompilation solves this problem with the use of tools that easily allows extraction of important files from the build in order to recreate the mod to almost a one to one replica. Currently, there are only a handful of people who know how to decompile a mod. I have reached out to one of these people to teach me. My plan is to document the process via the KTANE FAQ bot so others can learn as well. My hope that if enough people are aware how it's done, the more source code will be found."
        },
        {
            "Title": "Minesweeper Predictor",
            "Description": "I'm calling this a predictor rather than a solver because of how different minesweeper is compared to other puzzles. If you make a mistake in Towers or Sudoku, you are still able to recover as there is no real punishment besides reverting your changes. In minesweeper however, if you step on a bomb, the game is over. Most of the puzzle solvers have done (and/or currently doing) can rely on recursion as a last resort. I want to see how not having that option will make creating this \"solver\" different."
        },
        {
            "Title": "Tax Calculator",
            "Description": "I don't like doing taxes and the process is a lot more convoluted than it should be. Although I have an accountant that handles these calculations for me, it's not a bad idea to understand how to do them myself."
        },
        {
            "Title": "Job Application Analysis",
            "Description": "When applying to jobs, it's a good idea to keep track of what jobs you have applied for including meta data. Information such as location, desired skills, and status of application to name a few. It can be difficult to get a general overview of the information just by looking at the sheet itself. I have tried using sheets functions in order to give various statistics. It's was doable, but not easy to maintain. It would be a lot easier if there was an application that took in some sort of file (csv for example), parse the information, ask the user what specific parameters they want to see, and display them via some sort of graphics like a pie chart."
        },
        {
            "Title": "Basketball Schedule Maker",
            "Description": "I am a big fan of basket and making the schedule schedule maker got me interested in generation. I am a fan of NBA basketball, and always wondered how difficult it is to make a season schedules.\nFor those who are unfamiliar with the sport, the NBA has 30 teams, with half being on the eastern conference, and the other half being on the western. Each team that are in the same conference face off 4 times while opposite conference teams face off only twice. Leading to a total of 82 games.\nThe prototype won’t be the most accurate as there are some factors as home vs away games, travel time, certain days being off limit, etc. Though I plan to add those the more I tweak the schedule"
        },
        {
            "Title": "Conway's Game of Life Revamped",
            "Description": "Looking over my first <a href=\"{root}/projects/index.html#Conway’s-Game-of-Life\" target=\"_blank\">Conway's Game of Life implementation</a>, it feels pretty bland. It make sense for it to be considering it was made during my second of college, and I was focusing more on how to use Javascript and animations. Though that doesn't mean I can't improve on the project. I have thought of having it more interactive with the user being able to pause/play the simulation, go back/forward to a specific state, change the size of the starting grid, and set which cells are dead or alive."
        }
    ]
}